title: Certutil Used for File Download
id: 6c3f8a22-5678-4aef-9c11-333333333333
status: experimental
description: Detects abuse of certutil.exe to download files from external URLs, a common LOLBin technique.
author: Nitish Kumar
date: 2026/02/18
references:
  - https://attack.mitre.org/techniques/T1105/
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection_image:
    Image|endswith: '\certutil.exe'
  selection_flags:
    CommandLine|contains:
      - '-urlcache'
      - '-split'
      - 'http'
  condition: selection_image and selection_flags
level: high
tags:
  - attack.command_and_control
  - attack.t1105