title: Suspicious PowerShell Execution with Hidden Window and NoProfile
id: 9a9f0a11-1234-4cde-8b12-222222222222
status: experimental
description: Detects PowerShell executions using -NoProfile and hidden window flags, commonly abused by attackers for stealthy execution.
author: Nitish Kumar
date: 2026/02/18
references:
  - https://attack.mitre.org/techniques/T1059/001/
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection_image:
    Image|endswith: '\powershell.exe'
  selection_flags:
    CommandLine|contains:
      - '-nop'
      - '-w hidden'
  filter_legit:
    ParentImage|endswith:
      - '\explorer.exe'
  condition: selection_image and selection_flags and not filter_legit
level: high
tags:
  - attack.execution
  - attack.t1059.001
